Table of Contents
 Class CombiItem
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Combi item
[OpenModelClass("CI.StructModel.Loading.CombiItem")]
public class CombiItem : OpenObject
Inheritance
object
OpenObject
CombiItem
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CombiItem()
Constructor
public CombiItem()
Properties
 Coeff
Coefficient
public double Coeff { get; set; }
Property Value
double
 Combination
Inserted another combination
public ReferenceElement Combination { get; set; }
Property Value
ReferenceElement
 Id
Id of CombiItem
public int Id { get; set; }
Property Value
int
 LoadCase
Load case
public ReferenceElement LoadCase { get; set; }
Property Value
ReferenceElement
 Edit this page